[
   {
      "url": "https://en.wikipedia.org/wiki/History_of_India",
      "paragraph": "According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between 73,000 and 55,000 years ago.[1]  However, the earliest known human remains in South Asia date to 30,000 years ago.  Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around 7,000 BCE.  At the site of Mehrgarh presence can be documented of the domestication of wheat and barley, rapidly followed by that of goats, sheep, and cattle.[2] By 4,500 BCE, settled life had spread more widely,[2] and began to gradually evolve into the Indus Valley Civilization, an early civilization of the Old world, which was contemporaneous with Ancient Egypt and Mesopotamia. This civilisation flourished between 2,500 BCE and 1900 BCE in what today is Pakistan and north-western India, and was noted for its urban planning, baked brick houses, elaborate drainage, and water supply.[3]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_last_survivors_of_historical_events",
      "paragraph": "A historical event can be defined as any occurrence from the past regardless of significance, with the term \"history\" an umbrella term relating to past events and any associated memories, discoveries, collections, organizations, presentations, and/or interpretations of them. This differs from a historic event which is often less inclusive, and stands out as having made a significant impact on history itself.[1]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_television_shows_based_on_Indian_history",
      "paragraph": "\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_reservation",
      "paragraph": "An Indian reservation is an area of land held and governed by a federally recognised Native American tribal nation which government is accountable to the U.S. Bureau of Indian Affairs and not to the state government in which it is located. Some of the country's 574[3] federally recognized tribes govern more than one \nof the 326[1] Indian reservations in the United States, while some share reservations, and others have no reservation at all. Historical piecemeal land allocations under the Dawes Act facilitated sales to non–Native Americans, resulting in some reservations becoming severely fragmented, with pieces of tribal and privately held land being treated as separate enclaves. This jumble of private and public real estate creates significant administrative, political and legal difficulties.[4]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857",
      "paragraph": "British victory\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_reenactment",
      "paragraph": "While historical reenactors are generally amateurs, some participants are members of armed forces or historians. The participants, called reenactors, often do research on the equipment, uniform, and other gear they will carry or use. Reenactors buy the apparel or items they need from specialty stores or make items themselves. Historical reenactments cover a wide span of history, from the Roman empire to the major world wars and the Korean War of the 20th century.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Rocks_Beach,_Florida",
      "paragraph": "Indian Rocks Beach, or IRB, is a city in Pinellas County, Florida, United States. The population was 4,286 at the 2018 census.[4] Indian Rocks Beach is part of the Tampa-St. Petersburg-Clearwater, FL Metropolitan Statistical Area. Located on the barrier island Sand Key, it has over two miles of beach along the Gulf of Mexico, with 26 public beach accesses.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events_(2000%E2%80%93present)",
      "paragraph": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Near_Eastern_and_Western_civilization",
      "paragraph": "Due to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of Near Eastern and Western civilization.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Parmanu:_The_Story_of_Pokhran",
      "paragraph": "Parmanu: The Story of Pokhran (transl. Atom; Hindi pronunciation: [pəɾmaːɳʊ]) is a 2018 Indian Hindi language historical drama film directed by Abhishek Sharma and jointly written by Saiwyn Quadras, Sanyuktha Chawla Sheikh and Sharma.[3] It was produced by Zee Studios, JA Entertainment and KYTA Productions banners. The film is based on the nuclear bomb test explosions conducted by the Indian Army at Pokhran in 1998.[4][5] It stars John Abraham, Diana Penty and Boman Irani in lead roles.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Anglo-Indian_people",
      "paragraph": "Anglo-Indian people fall into two different groups: those with mixed Indian and British ancestry, and people of British descent born or residing in India. The latter sense is now mainly historical,[5][6] but confusions can arise. The Oxford English Dictionary, for example, gives three possibilities: \"Of mixed British and Indian parentage, of Indian descent but born or living in Britain or (chiefly historical) of English descent or birth but living or having lived long in India\".[7] People fitting the middle definition are more usually known as British Asian or British Indian. This article focuses primarily on the modern definition, a distinct minority community of mixed Eurasian ancestry, whose first language is English. According to the Indian government , one is considered an Anglo-Indian if he or she has an British ancestor in paternal line. As the term Euro-Indians would be confused with Indo-Europeans, the group now also includes Hispano-Indians, those who have a Portuguese ancestor in paternal line, therefore the Anglo-Indians can have  either an Iberian or a British surname. The early wave of Greek settlers after Alexanders' conquest are wholly assimilated, so there are no Greek-Indians anymore.  \n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_Indian_massacres_in_North_America",
      "paragraph": "In the history of the European colonization of the Americas, an Indian massacre is any incident between European settlers and indigenous peoples wherein one group killed a significant number of the other group outside the confines of mutual combat in war.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/1971:_Beyond_Borders",
      "paragraph": "1971: Beyond Borders is a 2017 Indian Malayalam-language war film written and directed by Major Ravi. It is the fourth installment in the Major Mahadevan film series, with Mohanlal reprising his role as Colonel Mahadevan and a new character, Major Sahadevan. It also features Arunoday Singh and Allu Sirish. The film, set in two time periods, is based on the Indo-Pakistani War of 1971 and act as both prequel and follow-up to the series. Mohanlal's and Sirish's characters were modeled on Hoshiar Singh and Arun Khetarpal, both of whom were awarded the Param Vir Chakra for their roles in the 1971 Indo-Pakistani War.[2]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_fiction",
      "paragraph": "An essential element of historical fiction is that it is set in the past and pays attention to the manners, social conditions and other details of the depicted period.[1] Authors also frequently choose to explore notable historical figures in these settings, allowing readers to better understand how these individuals might have responded to their environments. Some subgenres such as alternate history and historical fantasy insert speculative or ahistorical elements into a novel.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_cuisine",
      "paragraph": "Indian cuisine consists of a variety of regional and traditional cuisines native to the Indian subcontinent. Given the diversity in soil, climate, culture, ethnic groups, and occupations, these cuisines vary substantially and use locally available spices, herbs, vegetables, and fruits.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/21_Sarfarosh_-_Saragarhi_1897",
      "paragraph": "21 Sarfarosh - Saragarhi 1897 is an Indian historical drama television series starring Mohit Raina, Prakhar Shukla and Mukul Dev. The show is based on the Battle of Saragarhi, fought between Sikh soldiers of the British Indian Army and Pashtun Orakzai tribesmen. Produced by Contiloe Entertainment, it ran from 12 February to 11 May 2018, on Discovery Jeet.[1][2][3][4]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/American_Indian_Wars",
      "paragraph": "As settlers spread westward across North America after 1780, armed conflicts increased in size, duration, and intensity between settlers and various Indian and First Nation tribes. The climax came in the War of 1812, when major Indian coalitions in the Midwest and the South fought against the United States and lost. Conflict with settlers became much less common and was usually resolved by treaty, often through sale or exchange of territory between the federal government and specific tribes. The Indian Removal Act of 1830 authorized the American government to enforce Indian removal from east of the Mississippi River to Indian Territory west on the American frontier, especially what became Oklahoma. The federal policy of removal was eventually refined in the West, as American settlers kept expanding their territories, to relocate Indian tribes to reservations.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_revisionism",
      "paragraph": "In historiography, historical revisionism is the re-interpretation of a historical account.[1] It usually involves challenging the orthodox (established, accepted or traditional) views held by professional scholars about a historical event or time-span or phenomenon, introducing contrary evidence, or reinterpreting the motivations and decisions of the people involved. The revision of the historical record can reflect new discoveries of fact, evidence, and interpretation, which then results in revised history. In dramatic cases, revisionism involves a reversal of older moral judgments.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Kesari_(2019_film)",
      "paragraph": "Kesari (transl. Saffron) is a 2019 Indian Hindi-language war film[3] written and directed by Anurag Singh. It was jointly produced by Aruna Bhatia, Karan Johar, Hiroo Yash Johar, Apoorva Mehta, and Sunir Khetarpal under the banners of Dharma Productions, Cape of Good Films, Azure Entertainment, and Zee Studios. The film stars Akshay Kumar with Parineeti Chopra in a special appearance, Vikram Singh Chauhan, Sarwar, Vansh Bhardwaj, Jaspreet Singh, Vivek Saini, Vikram Kochhar, and Rakesh Sharma in supporting roles. It follows the events leading to the Battle of Saragarhi, a battle between 21 soldiers of the 36th Sikhs of the British Indian Army and 10,000 Afridi and Orakzai Pashtun tribesmen in 1897.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_trauma",
      "paragraph": "According to its advocates, HTR is exhibited in a variety of ways, most prominently through substance abuse, which is used as a vehicle for attempting to numb pain. This model seeks to use this to explain other self-destructive behaviour, such as suicidal thoughts and gestures, depression, anxiety, low self-esteem, anger, violence and difficulty recognising and expressing emotions. Many historians and scholars believe the manifestations of violence and abuse in certain communities are directly associated with the unresolved grief that accompanies continued trauma.[1]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Anti-Indian_sentiment",
      "paragraph": "Anti-Indian sentiment refers to negative feelings and hatred towards the Republic of India, Indian people, and Indian culture.[1] Indophobia is formally defined in the context of anti-Indian prejudice as \"a tendency to react negatively towards people of Indian extraction against aspects of Indian culture and normative habits\".[2]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Non-resident_Indian_and_person_of_Indian_origin",
      "paragraph": "Overseas Indians, officially known as Non-Resident Indians (NRIs) or Persons of Indian Origin (PIOs), are people of Indian birth or ancestry who live outside the Republic of India. According to a Ministry of External Affairs report, there are 32 million NRIs and PIOs residing outside India and overseas Indians comprise world's largest overseas diaspora.[1] Every year 2.5 million (25 lakhs) Indians migrate overseas, which is the highest annual number of migrants in the world.[8]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/All_India_Anglo-Indian_Association",
      "paragraph": "The All India Anglo-Indian Association holds that Anglo-Indians are unique in that they are Christians, speak English as their mother tongue, as well as have a historical link to both Europe and India.[4] During the era of the British Raj in India, the then president of the All-India Anglo-Indian Association represented the Anglo-Indian community of undivided India at the Round Table Conferences.[5] At the time of the Indian independence movement, the All-India Anglo-Indian Association opposed the partition of India; its then president Frank Anthony \"fought for the best interests of his community as Indians, not Britishers,\" criticizing the British for \"racial discrimination in matters of pay and allowances, and for failing to acknowledge the sterling military and civil contributions made by Anglo-Indians to the Raj\".[6][7] In September 1942, at the organisation's annual general meeting, the All India Anglo-Indian Association affirmed its love for and loyalty to India.[8] The organisation's efforts under the presidency of Anthony led to Article 331 being included in the Constitution of India:[9] \"Notwithstanding anything in Article 170, the Governor of a State may, if he is of opinion that the Anglo-Indian community needs representation in the Legislative Assembly of the State and is not adequately represented therein, [nominate one member of that community to the Assembly].\"[9]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Armed_Forces",
      "paragraph": "The Indian Armed Forces are the military forces of the Republic of India. It consists of three professional uniformed services: the Indian Army, Indian Navy, and Indian Air Force.[12] Additionally, the Indian Armed Forces are supported by the Central Armed Police Forces,[13] Assam Rifles, Indian Coast Guard and Special Frontier Force and various inter-service commands and institutions such as the Strategic Forces Command, the Andaman and Nicobar Command and the Integrated Defence Staff. The President of India is the Supreme Commander of the Indian Armed Forces. The Indian Armed Forces are under the management of the Ministry of Defence (MoD) of the Government of India. With strength of over 1.4 million active personnel,[14][15] it is the world's second-largest military force and has the world's largest volunteer army.[16] It also has the third-largest defence budget in the world.[17] As per 2015 Credit Suisse report, the Indian Armed Forces is the world's fifth-most powerful military,[18] whereas the 2020 GlobalFirepower report lists it as the fourth most-powerful military.[19]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events",
      "paragraph": "Not all films have remained true to the genuine history of the event or the characters they are portraying, often adding action and drama to increase the substance and popularity of the film. True story films[1] gained popularity in the late 1980s and early 1990s, with the production of films based on actual events that first aired on CBS, ABC, and NBC. The Movies Based on True Stories Database by Traciy Curry-Reyes was the first to compile a list of films based on true stories, and was the first site to coin the term \"movies based on true stories\" in the 1990s.[citation needed] This list should only include films supported by a Wikipedia article.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Accounting_Standards",
      "paragraph": "Indian Accounting Standard (abbreviated as Ind-AS) is the Accounting standard adopted by companies in India and issued under the supervision of Accounting Standards Board (ASB) which was constituted as a body in the year 1977. ASB is a committee under Institute of Chartered Accountants of India (ICAI) which consists of representatives from government department, academicians, other professional bodies viz. ICAI, representatives from ASSOCHAM, CII, FICCI, etc. ICAI is an independent body formed under an act of parliament.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Flag_of_India",
      "paragraph": "The National Flag of India (Hindi: Tiraṅgā) is a horizontal rectangular tricolour of India saffron, white and India green; with the Ashoka Chakra, a 24-spoke wheel, in navy blue at its centre. It was adopted in its present form during a meeting of the Constituent Assembly held on 22 July 1947, and it became the official flag of the Dominion of India on 15 August 1947. The flag was subsequently retained as that of the Republic of India. In India, the term \"tricolour\" almost always refers to the Indian national flag. The flag is based on the Swaraj flag, a flag of the Indian National Congress designed by Pingali Venkayya.[N 1]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Veerapandiya_Kattabomman_(film)",
      "paragraph": "Veerapandiya Kattabomman (transl. Kattabomman, the Brave Warrior) is a 1959 Indian Tamil-language biographical war film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan, Padmini, S. Varalakshmi, and Ragini, with V. K. Ramasamy and Javar Seetharaman in supporting roles. Its soundtrack and score were composed by G. Ramanathan.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Viceroy%27s_House_(film)",
      "paragraph": "Viceroy's House is a 2017 British-Indian fictional historical drama film directed by Gurinder Chadha and written by Paul Mayeda Berges, Moira Buffini, and Chadha.[4] The film stars Hugh Bonneville, Gillian Anderson, Manish Dayal, Huma Qureshi, and Michael Gambon.[5] It was selected to be screened out of competition at the 67th Berlin International Film Festival.[6]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Ocean",
      "paragraph": "The Indian Ocean is the third-largest of the world's five oceanic divisions, covering 70,560,000 km2 (27,240,000 sq mi) or 19.8% of the water on Earth's surface.[5] It is bounded by Asia to the north, Africa to the west and Australia to the east. To the south it is bounded by the Southern Ocean or Antarctica, depending on the definition in use.[6] Along its core, the Indian Ocean has some large marginal or regional seas such as the Arabian Sea, the Laccadive Sea, the Somali Sea, Bay of Bengal, and the Andaman Sea.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Tanhaji",
      "paragraph": "Tanhaji: The Unsung Warrior is a 2020 Indian Hindi-language historical action film, co-written and directed by Om Raut and produced by Bhushan Kumar, Krishan Kumar and Ajay Devgn under T-Series Films and Ajay Devgn FFilms. Tracing the life of Maratha warrior Tanaji Malusare, it stars Ajay Devgn in titular role, in addition to Saif Ali Khan and Kajol in important supporting roles, it also features Neha Sharma, Sharad Kelkar and Luke Kenny in other supporting roles.[4] Set in the 17th century, it revolves around Tanaji's attempts to recapture the Kondhana fortress once it passes on to Mughal emperor Aurangzeb who transfers its control to his trusted Rajput guard Udaybhan Singh Rathore.The film was originally named Taanaji: The Unsung Warrior but the name was later changed to Tanhaji; The Unsung Warrior for numerological reasons.[5][6]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Gajakesari",
      "paragraph": "Gajakesari is a 2014 Indian Kannada-language historical action film directed by cinematographer Krishna and produced by Jayanna and Bogendra. The film stars Yash in leading role along with Amulya and Anant Nag. The film also prominently features an elephant named Arjuna from Waynad, Kerala.[1] Actor Prakash Raj plays as narrator for the film to introduce Yash's character. Also uncredited writer Sai Prasad did the still photography and concept design for the making of the movie. This film is also dubbed in Hindi as Gajakeasari:The Big Lion.[2]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Shunga_Empire",
      "paragraph": "The Shunga Empire (IAST: Śuṅga) was an ancient Indian dynasty from Magadha that controlled areas of the central and eastern Indian subcontinent from around 184 to 75 BCE. The dynasty was established by Pushyamitra Shunga, after taking the throne of the Maurya Empire. Its capital was Pataliputra, but later emperors such as Bhagabhadra also held court at Besnagar (modern Vidisha) in eastern Malwa.[1]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Sino-Indian_War",
      "paragraph": "Chinese victory[2]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/National_Film_Awards",
      "paragraph": "Hellaro\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_history",
      "paragraph": "This is a timeline of Indian history, comprising important legal and territorial changes and political events in India and its predecessor states. To read about the background to these events, see History of India.  See also the list of governors-general of India, list of prime ministers of India and Years in India.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/The_Empire_(TV_series)",
      "paragraph": "The Empire is an Indian historical fiction period drama streaming television series created by Nikkhil Advani and directed by Mitakshara Kumar based on the novel series Empire of the Moghul by Alex Rutherford for Disney+ Hotstar.[1][2] The series was premiered on Disney+ Hotstar on 27 August 2021.[3]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_independence_movement",
      "paragraph": "The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from 1857 to 1947.[1]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Chittagong_(film)",
      "paragraph": "Chittagong is a 2012 Indian historical war drama film directed by Bedabrata Pain.[9][10][11] It stars Manoj Bajpayee in the lead role and is based upon events of British India's Chittagong Uprising.[12][13] The film features music by trio Shankar–Ehsaan–Loy and sound by Resul Pookutty.[14] The world premier of film was on 10 April 2012.[15] Chittagong released on 12 October 2012 and nett grossed Rs 3.1 million at the  Indian box office. This movie won the 60th National Film Awards for the Best Debut Film of a Director.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_equipment_of_the_Indian_Army",
      "paragraph": "This is a list of present equipment used by the Indian Army.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_people",
      "paragraph": "Significant Minority: Islam \n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Americans",
      "paragraph": "Indian Americans or Indo-Americans are citizens of the United States with ancestry from India. The United States Census Bureau uses the term Asian Indian to avoid confusion with Native Americans. With a population of almost four million, Indian Americans make up 1.2% of the U.S. population and are the largest group of South Asian Americans, as well as the second largest group[7] of Asian Americans after Chinese Americans.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/British_Raj",
      "paragraph": "The British Raj (/rɑːdʒ/; from Hindi rāj: kingdom, realm, state, or empire.[2][a]) was the rule of the British Crown on the Indian subcontinent from 1858 to 1947.[4][5][6][7] The rule is also called Crown rule in India,[8] or direct rule in India.[9] The region under British control was commonly called India in contemporaneous usage and included areas directly administered by the United Kingdom, which were collectively called British India, and areas ruled by indigenous rulers, but under British paramountcy, called the princely states. The region was sometimes called the Indian Empire, though not officially.[10]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/2015_in_British_television",
      "paragraph": "This is a list of events that took place in 2015 related to British television.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Television_Academy_Awards",
      "paragraph": "Gautam RodeKarishma Tanna\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Mangal_Pandey:_The_Rising",
      "paragraph": "Mangal Pandey: The Rising (internationally known as The Rising: Ballad of Mangal Pandey) is a 2005 Indian historical biographical drama film based on the life of Mangal Pandey, an Indian soldier known for helping to spark the Indian rebellion of 1857 (also known as The First War of Indian Independence).\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Raag_Desh_(film)",
      "paragraph": "Raag Desh (transl. Love the country) is a 2017 Indian historical action drama film directed by Tigmanshu Dhulia and produced by Gurdeep Singh Sappal and Rajya Sabha TV.[3][4][5] The film is based on Indian National Army trials, the joint court martial of  Indian National Army officers Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, Major Shah Nawaz Khan.[6] The leading roles in Raag Desh have been played by Kunal Kapoor, Amit Sadh, Mohit Marwah and Mrudula Murali.[7] The film was released on July 28, 2017.[8][1] Rishi Punjabi is the cinematographer of the film.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Native_Americans_in_the_United_States",
      "paragraph": "Native Americans, also known as American Indians, First Americans, Indigenous Americans and other terms, are the Indigenous peoples of the United States; sometimes including Hawaii and territories of the United States, and other times limited to the mainland. There are 574 federally recognized tribes living within the US, about half of which are associated with Indian reservations. \"Native Americans\" (as defined by the United States Census) are Indigenous tribes that are originally from the contiguous United States, along with Alaska Natives.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_rupee",
      "paragraph": "\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Origins_of_the_Sino-Indian_War",
      "paragraph": "A long series of events triggered the Sino-Indian War in 1962. According to John W. Garver, Chinese perceptions about the Indian designs for Tibet, and the failure to demarcate a common border between China and India (including the Indian Forward Policy)[1][2] were important in China's decision to fight a war with India.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/American_Indian_boarding_schools",
      "paragraph": "American Indian boarding schools, also known more recently as American Indian Residential Schools, were established in the United States from the mid 17th to the early 20th centuries with a primary objective of \"civilizing\" or assimilating Native American children and youth into Euro-American culture. In the process, these schools denigrated Native American culture and made children give up their languages and religion.[1] At the same time the schools provided a basic Western education. These boarding schools were first established by Christian missionaries of various denominations. The missionaries were often approved by the federal government to start both missions and schools on reservations,[2] especially in the lightly populated areas of the West. In the late 19th and early 20th centuries especially, the government paid religious orders to provide basic education to Native American children on reservations, and later established its own schools on reservations. The Bureau of Indian Affairs (BIA) also founded additional off-reservation boarding schools based on the assimilation model. These sometimes drew children from a variety of tribes. In addition, religious orders established off-reservation schools.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_negationism",
      "paragraph": "Some countries, such as Germany, have criminalized the negationist revision of certain historical events, while others take a more cautious position for various reasons, such as protection of free speech; others mandate negationist views, such as California and Japan, where schoolchildren are explicitly prevented from learning about the California genocide[7][8] and Japanese war crimes,[9][10] respectively. Notable examples of negationism include Holocaust denial, Armenian genocide denial, the Lost Cause of the Confederacy, the myth of the clean Wehrmacht, Japanese history textbook controversies, and historiography in the Soviet Union during the Stalin era.[11][12] Some notable historical negationists include Arthur Butz, David Irving, and Shinzo Abe. In literature, the consequences of historical negationism have been imaginatively depicted in some works of fiction, such as Nineteen Eighty-Four, by George Orwell. In modern times, negationism may spread via new media, such as the Internet.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_National_Congress",
      "paragraph": "(4025 MLAs & 11 Vacant)\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Airlift_(film)",
      "paragraph": "Airlift is a 2016 Indian Hindi-language historical drama film directed by Raja Krishna Menon starring Akshay Kumar and Nimrat Kaur, that follows Ranjit Katyal (played by Kumar), a Kuwait-based businessman as he carries out the evacuation of Indians based in Kuwait during the Invasion of Kuwait by Saddam Hussein's Iraq.[1] The film was jointly produced by Abundantia Entertainment, Cape of Good Films, Emmay Entertainment, Hari Om Entertainment, T-Series and Viacom 18 Motion Pictures on a total budget of ₹320 million.[4] The plot is adapted from real life story of a Kuwait-based Malayali businessman Mathunny Mathews.[5]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Matchmaking",
      "paragraph": "Indian Matchmaking was released on July 16, 2020, on Netflix. \n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/French_and_Indian_War",
      "paragraph": "British victory\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Mughal-e-Azam",
      "paragraph": "Mughal-e-Azam (transl. The Great Mughal) is a 1960 Indian epic historical drama film directed by K. Asif and produced by Shapoorji Pallonji. Starring Prithviraj Kapoor, Madhubala, Durga Khote and Dilip Kumar, it follows the love affair between Mughal Prince Salim (who went on to become Emperor Jahangir) and Anarkali, a court dancer. Salim's father, Emperor Akbar, disapproves of the relationship, which leads to a war between father and son.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Kappalottiya_Thamizhan",
      "paragraph": "Kappalottiya Thamizhar (transl. The Tamilian who launched a ship) is a 1961 Indian Tamil-language historical drama film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan and Savitri. It is based on the 1944 book of the same name by M. P. Sivagnanam, a biography of V. O. Chidambaram Pillai who founded the Swadeshi Stream Navigation Company to break the monopoly of the British over maritime trade out of India.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Asia",
      "paragraph": "Due to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of East Asia, Central Asia, and India. For films pertaining to the history of Near Eastern and Western civilisation, please refer to list of historical period drama films and series set in Near Eastern and Western civilization.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Ocean_Dipole",
      "paragraph": "The IOD involves an aperiodic oscillation of sea-surface temperatures (SST), between \"positive\", \"neutral\" and \"negative\" phases. A positive phase sees greater-than-average sea-surface temperatures and greater precipitation in the western Indian Ocean region,[dubious  – discuss] with a corresponding cooling of waters in the eastern Indian Ocean—which tends to cause droughts in adjacent land areas of Indonesia and Australia. The negative phase of the IOD brings about the opposite conditions, with warmer water and greater precipitation in the eastern Indian Ocean, and cooler and drier conditions in the west.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_Roasts",
      "paragraph": "On September 20, 2018, Deadline reported that Netflix had ordered 6 episodes of the series.[6]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
      "paragraph": "\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Culture_of_India",
      "paragraph": "Indian culture is the heritage of social norms, ethical values, traditional customs, belief systems, political systems, artifacts and technologies that originated in or are associated with the ethno-linguistically diverse Indian subcontinent. The term also applies beyond India to countries and cultures whose histories are strongly connected to India by immigration, colonization, or influence, particularly in South Asia and Southeast Asia. India's languages, religions, dance, music, architecture, food and customs differ from place to place within the country.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Independence_Day_(India)",
      "paragraph": "Independence Day is celebrated annually on 15 August as a national holiday in India commemorating the nation's independence from the United Kingdom on 15 August 1947, the day when the provisions of the 1947 Indian Independence Act, which transferred legislative sovereignty to the Indian Constituent Assembly, came into effect. India retained King George VI as head of state until its transition to a republic, when the nation adopted the Constitution of India on 26 January 1950 (celebrated as Indian Republic Day) and replaced the dominion prefix, Dominion of India, with the enactment of the sovereign law Constitution of India. India attained independence following the Independence Movement noted for largely non-violent resistance and civil disobedience.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Lists_of_21st-century_earthquakes",
      "paragraph": "The following is a summary of significant earthquakes during the 21st century.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/List_of_programmes_broadcast_by_Colors_TV",
      "paragraph": "The following is the list of current, upcoming and former television shows broadcast by the Indian television channel Colors TV.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_National_Army",
      "paragraph": "The Indian National Army (INA; Azad Hind Fauj /ˈɑːzɑːð ˈhinð ˈfɔːdʒ/; lit. 'Free Indian Army') was an armed force formed by Indian freedom fighters/collaborators and Imperial Japan on 1 September 1942 in Southeast Asia during World War II. Its aim was to secure Indian independence from British rule. It fought alongside Japanese soldiers in the latter's campaign in the Southeast Asian theatre of WWII.[1] The army was first formed in 1942 under Captain Mohan Singh by Indian PoWs of the British-Indian Army captured by Japan in the Malayan campaign and at Singapore.[2] This first INA,which had been handed over to Rash Behari Bose, collapsed and was disbanded in December that year after differences between the INA leadership and the Japanese military over its role in Japan's war in Asia. Rash Behari Bose handed over INA to Subhas Chandra Bose.[3] It was revived under the leadership of Subhas Chandra Bose after his arrival in Southeast Asia in 1943. The army was declared to be the army of Bose's Arzi Hukumat-e-Azad Hind (the Provisional Government of Free India).[4] Netaji Subhas Chandra Bose named the brigades/regiments of INA after Gandhi, Nehru, Maulana Azad, and himself.[5] There was also an all-women regiment named after Rani of Jhanshi, Lakshmibai. Under Bose's leadership, the INA drew ex-prisoners and thousands of civilian volunteers from the Indian expatriate population in Malaya (present-day Malaysia) and Burma.[6] This second INA fought along with the Imperial Japanese Army against the British and Commonwealth forces in the campaigns in Burma: at Imphal and Kohima, and later against the Allied retaking of Burma.[7][8]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/22_June_1897",
      "paragraph": "22 June 1897 is a 1979 Marathi film co-written by Shankar Nag and Nachiket Patwardhan and directed by the husband and wife team of Jayoo Patwardhan and Nachiket Patwardhan. The duo are also practising architects. It is based on the true life story of the assassination of British Government officers Walter Charles Rand ICS and Lt. Charles Egerton Ayerst by the Chapekar brothers.\nThe film has been included in the book One Hundred Indian Feature Films: An Annotated Filmography, a representative selection from the first Indian talkies to the then-present date (1988). The title of the film is the date of the assassination, 22 June 1897. It won the 1980 Indian Silver Lotus at the National Film Awards in two categories: Best film on National Integration and Art Direction. It also won the 1980 Maharashtra State awards for best film of the year and best director. The film has been included in the selected collection of Indian films and videos in the US Library of Congress. Most of the performers in the film then belonged to Theatre Academy, Pune.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Coins_of_the_Indian_rupee",
      "paragraph": "After Indian independence, British Indian coins were in use as a frozen currency until India became a republic in 1950. The first rupee coins of the Republic of India were minted in 1950.[3] These included 1/2 rupee, 1/4 rupee, 2 anna, 1 anna, 1/2 anna & 1 pice coins, and are referred to as the anna series or pre-decimal coinage. Under the anna series, one rupee was divided into 16 annas or 64 pice, with each anna equal to 4 pice.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Islam_in_India",
      "paragraph": "Islam is the second-largest religion in India,[5] with 14.9% of the country's population, approximately 195 million people identifying as adherents of Islam in 2015.[1][6] India is the country with the second or third largest number of Muslims in the world.[1][7] The majority of Indian Muslims belong to the Sunni sect of Islam, while the Shia form a sizeable minority.[citation needed] Islam existed in Indian communities along the Arab coastal trade routes in Gujarat, and Malabar as soon as the religion originated and had gained early acceptance in the Arabian Peninsula. \n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Carlisle_Indian_Industrial_School",
      "paragraph": "The United States Indian Industrial School in Carlisle, Pennsylvania, generally known as Carlisle Indian Industrial School, was the flagship Indian boarding school in the United States from 1879 through 1918. It took over the historic Carlisle Barracks, which was transferred to the Department of Interior from the War Department. After the United States entry into World War I, the school was closed and this property was transferred back to the Department of Defense. All the property is now part of the U.S. Army War College.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/American_Association_of_Physicians_of_Indian_Origin",
      "paragraph": "The association is based in Chicago and was founded in 1984. As of 2019, it claims a membership of 80,000 physicians.[1]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Multi-sport_event",
      "paragraph": "The Ancient Olympic Games, first held in 776 BC, was the precursor to the Modern Olympic Games, although its first edition only featured a footrace and the number of sporting competitions expanded at later editions.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Ojibwe",
      "paragraph": "According to the US census, in the United States Ojibwe people are one of the largest tribal populations among Native American peoples. In Canada, they are the second-largest First Nations population, surpassed only by the Cree. They are one of the most numerous Indigenous Peoples north of the Rio Grande.[3][better source needed] The Ojibwe population is approximately 320,000 people, with 170,742 living in the United States as of 2010[update],[1] and approximately 160,000 living in Canada.[2] In the United States, there are 77,940 mainline Ojibwe; 76,760 Saulteaux; and 8,770 Mississauga, organized in 125 bands. In Canada, they live from western Quebec to eastern British Columbia.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Canadian_Indian_residential_school_system",
      "paragraph": "In Canada, the Indian residential school system[nb 1] was a network of boarding schools for Indigenous peoples.[nb 2] Attendance was mandatory from 1894 to 1947. The network was funded by the Canadian government's Department of Indian Affairs and administered by Christian churches. The school system was created to isolate Indigenous children from the influence of their own native culture and religion in order to assimilate them into the dominant Canadian culture.[3][4][5]: 42 [6] Over the course of the system's more than hundred-year existence, around 150,000 children were placed in residential schools nationally.[7]: 2–3  By the 1930s about 30 percent of Indigenous children were believed to be attending residential schools.[8] The number of school-related deaths remains unknown due to incomplete records. Estimates range from 3,200 to over 30,000.[9][10][11][12]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Tamil_historical_novels",
      "paragraph": "Prathaapa Mudaliaar Charithram (\"The Life of Prathaapa Mudaliaar\"), written in 1857 and published in 1879, was the first novel in the Tamil language. The novel does not involve historical characters or events but is set in royal times.  Penned by Maayuram Vedanaayakam Pillai, it was a landmark in Tamil literature, which had hitherto seen writings only in poetry. The book gave birth to a new literary genre and Tamil prose began to be recognized as an increasingly important part of the language. One can see the style of any Tamil author in this novel.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_innovation",
      "paragraph": "The entries in this timeline fall into the following categories: architecture, astronomy, cartography, metallurgy, logic, mathematics, metrology, mineralogy, automobile engineering, information technology, communications, space and polar technology.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Institute_of_Science",
      "paragraph": "The Indian Institute of Science (IISc) is a public, deemed, research university for higher education and research in science, engineering, design, and management. It is located in Bengaluru, in the Indian state of Karnataka. The institute was established in 1909 with active support from Jamsetji Tata and thus is also locally known as the \"Tata Institute\".[5] It is ranked among the most prestigious academic institutions in India[6] and has the highest citation per faculty among all the universities in the world.[7] It was granted the deemed to be university status in 1958 and the Institute of Eminence status in 2018.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Visa_requirements_for_Indian_citizens",
      "paragraph": "Visa requirements for Indian citizens are administrative entry restrictions by the authorities of other states placed on citizens of India. as of 12 January 2022,[update] Indian citizens had visa-free or visa on arrival access to 60 countries and territories, ranking the Indian passport 83rd in terms of travel freedom according to the Henley Passport Index.[1] With visa free entry to 22 countries and visa on arrival facility to 41 countries India shares 60th rank in Global Passport Power Rank.[2]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Act",
      "paragraph": "The Indian Act (Loi sur les Indiens, long name An Act to amend and consolidate the laws respecting Indians)[1] is a Canadian act of Parliament that concerns registered Indians, their bands, and the system of Indian reserves.[2][3] First passed in 1876 and still in force with amendments, it is the primary document that defines how the Government of Canada interacts with the 614 First Nation bands in Canada and their members. Throughout its long history, the act has been a subject of controversy and has been interpreted in different ways by both Indigenous Canadians and non-Indigenous Canadians. The legislation has been amended many times, including \"over five major changes\" made in 2002.[4]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/American_Indian_Movement",
      "paragraph": "AIM was organized by Native American men who had been serving together in prison. They had been alienated from their traditional backgrounds as a result of the United States' Public Law 959 Indian Relocation Act of 1956, which supported thousands of Native Americans in moving from reservations to cities, in an effort to enable them to have more economic opportunities for work. In addition, Public Law 280, otherwise known as the Indian Termination Act, proposed to terminate the federal government's relations with several tribes determined to be far along the path of assimilation.[4] These policies were enacted by the United States Congress under congressional plenary power.[5] As a result, nearly seventy percent of American Indians left their communal homelands on reservations and relocated to urban centers, many in hopes of finding economic sustainability. While many Urban Indians struggled with displacement and such radically different settings, some also began to organize in pan-Indian groups in urban centers. They were described as transnationals. [6] The American Indian Movement formed in such urbanized contexts, at a time of increasing Indian activism.[6]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Wind_River_Indian_Reservation",
      "paragraph": "The Wind River Indian Reservation is the seventh-largest American Indian reservation in the United States by area and the fifth-largest[4] by population. The land area is approximately 2.2 million acres (3,438 sq mi; 8,903 km2), and the total area (land and water) is 3,532.01 square miles (9,147.9 km2). The reservation constitutes just over one-third of Fremont County and over one-fifth of Hot Springs County.[5]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Territory",
      "paragraph": "The term Indian Reserve describes lands the British set aside for Indigenous tribes between the Appalachian Mountains and the Mississippi River in the time before the American Revolutionary War (1775–1783).\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_School_of_Business",
      "paragraph": "The Indian School of Business (ISB) is a private business school established in India in 2001. It has two parallel campuses in India, in Hyderabad (Telangana) and Mohali (Punjab). It offers certificates in various post-graduate management programs.[6] ISB became the 100th Triple Accredited business school in the world (AMBA, EQUIS, AACSB) upon achieving AMBA accreditation on 12 May 2020.[3]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/The_Battle_of_Bhima_Koregaon_(film)",
      "paragraph": "The Battle of Bhima Koregaon is an upcoming Indian Hindi-language period war drama film directed and produced by Ramesh Thete under his banner Ramesh Thete Films.[1] It depicts the events that took place during the Battle of Koregaon. The film stars Arjun Rampal as a Mahar warrior Sidhnak Inamdar, and Digangana Suryavanshi.[2][3]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/British_Indians",
      "paragraph": "British Indians  are citizens of the United Kingdom (UK) whose ancestral roots are from India. This includes people born in the UK who are of Indian origin as well as Indians who have migrated to the UK. Today, Indians comprise about 1.4 million people in the UK, making them the single largest visible ethnic minority population in the country. They make up the largest subgroup of British Asians and are one of the largest Indian communities in the Indian diaspora, mainly due to the Indian–British relations (including historical links such as India having been part of the British Empire and still being part of the Commonwealth of Nations). The British Indian community is the sixth largest in the Indian diaspora, behind the Indian communities in the United States, Saudi Arabia, the United Arab Emirates, Malaysia and Nepal. The majority of British Indians are of Punjabi and Gujarati descent, with smaller communities of Tamilian, Bengali, Malayali, Konkani, Marathi and Telugu communities.[2]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Alexander_(2004_film)",
      "paragraph": "Alexander is a 2004 epic historical drama film based on the life of the ancient Macedonian general and king Alexander the Great. It was directed by Oliver Stone and starred Colin Farrell. The film's original screenplay derived in part from the book Alexander the Great, published in 1973 by the University of Oxford historian Robin Lane Fox. After release, while it performed well in Europe, the American critical reaction was negative. It grossed over $167 million worldwide against a $155 million budget, thus making it a commercial failure.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Economy_of_India",
      "paragraph": " 9.5% (21/22f) (WB)[8]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Chandralekha_(1948_film)",
      "paragraph": "Chandralekha (also spelt Chandraleka)[b] is a 1948 Indian historical adventure film produced and directed by S. S. Vasan of  Gemini Studios. Starring T. R. Rajakumari, M. K. Radha and Ranjan, the film follows two brothers (Veerasimhan and Sasankan) who fight over ruling their father's kingdom and marrying the village dancer, Chandralekha.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Border_(1997_film)",
      "paragraph": "Border is a 1997 Indian Hindi-language epic war film directed, produced and written by J. P. Dutta. Set during the Indo-Pakistani War of 1971, it is an adaptation of real life events that happened during the Battle of Longewala in 1971.[2] The film stars an ensemble cast of Sunny Deol, Sunil Shetty, Akshaye Khanna, Jackie Shroff, Sudesh Berry, Puneet Issar and Kulbhushan Kharbanda. Tabu, Raakhee, Pooja Bhatt and Sharbani Mukherjee feature in supporting roles.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historiography",
      "paragraph": "In the ancient world, chronological annals were produced in civilizations such as ancient Egypt and Mesopotamia. However, the discipline of historiography was first established in the 5th century BC with the Histories of Herodotus, the founder of historiography. The Roman statesman Cato the Elder produced the first history in Latin, the Origines, in the 2nd century BC. His near contemporaries Sima Tan and Sima Qian in the Han Empire of China established Chinese historiography with the compiling of the Shiji (Records of the Grand Historian). During the Middle Ages, medieval historiography included the works of chronicles in medieval Europe, Islamic histories by Muslim historians, and the Korean and Japanese historical writings based on the existing Chinese model. During the 18th-century Age of Enlightenment, historiography in the Western world was shaped and developed by figures such as Voltaire, David Hume, and Edward Gibbon, who among others set the foundations for the modern discipline.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Winter_Olympic_Games",
      "paragraph": "The Winter Olympic Games (French: Jeux olympiques d'hiver)[nb 1] is a major international multi-sport event held once every four years for sports practiced on snow and ice. The first Winter Olympic Games, the 1924 Winter Olympics, were held in Chamonix, France. The modern Olympic Games were inspired by the ancient Olympic Games, which were held in Olympia, Greece, from the 8th century BC to the 4th century AD. Baron Pierre de Coubertin founded the International Olympic Committee (IOC) in 1894, leading to the first modern Summer Olympic Games in Athens, Greece in 1896. The IOC is the governing body of the Olympic Movement, with the Olympic Charter defining its structure and authority.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/2004_Indian_Ocean_earthquake_and_tsunami",
      "paragraph": "The 2004 Indian Ocean earthquake and tsunami (also known as the Boxing Day Tsunami and, by the scientific community, the Sumatra–Andaman earthquake[10][11]) occurred at 07:58:53 local time (UTC+7) on 26 December, with an epicentre off the west coast of northern Sumatra, Indonesia. It was an undersea megathrust earthquake that registered a magnitude of 9.1–9.3 Mw, reaching a Mercalli intensity up to IX in certain areas. The earthquake was caused by a rupture along the fault between the Burmese Plate and the Indian Plate.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_National_Army_trials",
      "paragraph": "The Indian National Army trials (also known as the INA trials and the Red Fort trials) was the British Indian trial by court-martial of a number of officers of the Indian National Army (INA) between November 1945 and May 1946, on various charges of treason, torture, murder and abetment to murder, during the Second World War. In total, approximately ten court-martials were held.  The first of these was the joint court-martial of Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, and Major-General Shah Nawaz Khan. The three had been officers in the British Indian Army and were taken prisoner in Malaya, Singapore and Burma. They had, like a large number of other troops and officers of the British Indian Army, joined the Indian National Army and later fought in Burma alongside the Japanese military under the Azad Hind. \n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/News",
      "paragraph": "News is information about current events. This may be provided through many different media: word of mouth, printing, postal systems, broadcasting, electronic communication, or through the testimony of observers and witnesses to events. News is sometimes called \"hard news\" to differentiate it from soft media.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Indian_Plate",
      "paragraph": "Until roughly 140 million years ago, the Indian Plate formed part of the supercontinent Gondwana together with modern Africa, Australia, Antarctica, and South America. Gondwana broke up as these continents drifted apart at different velocities,[9] a process which led to the opening of the Indian Ocean.[10]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Partition_of_India",
      "paragraph": "The partition of India was the division of British India[c] in 1947 into two independent Dominions: India and Pakistan.[6] The Dominion of India is today the Republic of India, and the Dominion of Pakistan is the Islamic Republic of Pakistan and the People's Republic of Bangladesh. The partition involved the division of two provinces, Bengal and Punjab, based on district-wide non-Muslim or Muslim majorities. The partition also saw the division of the British Indian Army, the Royal Indian Navy, the Royal Indian Air Force, the Indian Civil Service, the railways, and the central treasury. The partition was outlined in the Indian Independence Act 1947 and resulted in the dissolution of the British Raj, i.e. Crown rule in India. The two self-governing independent Dominions of India and Pakistan legally came into existence at midnight on 15 August 1947.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/The_Forgotten_Army_-_Azaadi_Ke_Liye",
      "paragraph": "The Forgotten Army – Azaadi Ke Liye is a streaming television series which premiered on Amazon Prime Video on 24 January 2020. The series is directed by Kabir Khan, and is based on true events about the men and women in the Indian National Army (INA) led by Subhash Chandra Bose.[2] The series stars Sunny Kaushal and Sharvari.[3] Kabir Khan made his directorial debut with a documentary titled The Forgotten Army in 1999 which was aired by Doordarshan; and during a promotional talk, Kabir Khan said the current series is a project that is 20 years in the making, based on his initial documentary.[4][5] The shooting took place in locations such as Thailand, Singapore, Malaysia and Mumbai.[4]\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Malliswari_(1951_film)",
      "paragraph": "Malliswari is a 1951 Indian Telugu-language historical romance film[3] produced and directed by B. N. Reddy under his banner Vauhini Studios. N. T. Rama Rao and P. Bhanumathi  star as a couple – Nagaraju and Malliswari – who are separated by Malliswari's greedy mother. Malliswari is sent to the king's palace according to the custom of \"Rani Vasam\", a tradition during the Vijayanagara Empire wherein young women were fetched to the palace with an offering gold and jewellery to their parents. The rest of the film focuses on the consequences faced by Nagaraju when he, against all rules, surreptitiously enters the palace to meet Malliswari.\n"
   },
   {
      "url": "https://en.wikipedia.org/wiki/Historical_race_concepts",
      "paragraph": "The word \"race\", interpreted to mean an identifiable group of people who share a common descent, was introduced into English in about 1580, from the Old French rasse (1512), from Italian razza. An earlier but etymologically distinct word for a similar concept was the Latin word genus meaning a group sharing qualities related to birth, descent, origin, race, stock, or family; this Latin word is cognate with the Greek words \"genos\", (γένος) meaning \"race or kind\", and \"gonos\", which has meanings related to \"birth, offspring, stock ...\".[2]\n"
   }
]